Repository: jhonvidal/djangocms_miblog
Catalog: blog/locale/*/LC_MESSAGES/django.po
Languages: es

source: Information
es: Información

source: Writing
es: Escribiendo

source: Blog
es: Articulos

source: Add post
es: Agregar articulo

source: Post list
es: Lista de articulos

source: Add category
es: Agregar categoría

source: Categories list
es: Lista de categorías

source: Title
es: Título

source: Category
es: Categoría

source: Categories
es: Categorias

source: Post title
es: Título de la noticia

source: Published on
es: Publicado en

source: Edit on
es: Editado en

source: Head picture
es: Imagen

source: Post
es: Articulo

source: is publish ?
es: ¿Es público?

source: Blog post
es: Articulo

source: Blog posts
es: Articulos publicados
